Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: It contains words or phrases that are hard to read or pronounce.
ha: Ya ƙunshi kalmomi ko jimloli masu wuyar karantawa ko furtawa.

source: It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout.
ha: Tabbataccen abu ne da mai karatu zai shagalta da abin karantawa na shafi lokacin da yake kallon shimfiɗarsa.

source: It is written in a language different than what I’m speaking.
ha: An rubuta shi a cikin yare dabam da abin da nake magana.

source: Izhorian
ha: Yaran Izran

source: Japanese
ha: Jafananci

source: Join the Common Voice mailing list
ha: Shiga jerin sawun aika saƙon Muryar gama gari

source: Kabardian
ha: Yaren Kabardian

source: Kabyle
ha: Yaren Kabyle

source: Kaqchikel
ha: Yaren Kaqchikel

source: Karakalpak
ha: Yaren Karakalpak

source: Kazakh
ha: Yaren Kazakh

source: Keep
ha: Ajiye

source: Keep it up, record again <recordIcon></recordIcon>
ha: Cigaba da ƙoƙari, ƙara naɗar <recordIcon></recordIcon>

source: Keep the recordings
ha: Bar naɗe-naɗe na

source: Keep track of your progress and metrics across multiple languages.
ha: Kula da cin gaban ka da ma'auninka a yaruka daban-daban

source: Keep track of your progress with a profile
ha: Kula da ci gaban ka tare da bayanin martabar ka

source: Keep track of your progress with a profile and help our voice data be more accurate.
ha: Ka lura da ci gabanka tare da profile ɗinka domin ka taimakawa ingancin bayananmu na muryoyi.

source: Kinyarwanda
ha: Yaren Kinyarwanda

source: Komi-Zyrian
ha: Yaren Komi-Zyrian

source: Korean
ha: Koriyanci

source: Kurdish
ha: Yaren Kurdish

source: Kurmanji Kurdish
ha: Yaren Kurmanji Kurdistan

source: Kyrgyz
ha: Yaren Kyrgyz

source: Language
ha: Yare

source: Language Request
ha: Neman Yare

source: Language request successfully submitted, thank you.
ha: An gabatar da buƙatar yare cikin nasara, na gode.

source: Languages
ha: Yaruka

source: Latvian
ha: Yaren Latbiya

source: Launched
ha: An ƙaddamar

source: Leaderboard Visibility
ha: Nuna allon jagora.

source: Learn how to request it here!
ha: koyi yadda zaka nema anan!

source: Learn More
ha: Ci gaba da koyo

source: Leaving now means you’ll lose your changes
ha: Tafiya yanzu yana nufin za ku rasa chanzin ku

source: Leaving now means you'll lose your progress
ha: Tafiya yanzu yana nufin za ku rasa cin gaban ku

source: Let's Get Started
ha: Bari Mu Fara

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
ha: LibriSpeech wata matattara ce ta kusan awanni 1000 na 16Khz karanta jawabin Ingilishi wanda aka samo daga karanta littattafan odiyo daga aikin LibriVox.

source: License
ha: Lasisi

source: License: <licenseLink>CC-0</licenseLink>
ha: Lasisi: <lasisiLink> CC-0 </ lasisi>

source: License: <licenseLink>{ $license }</licenseLink>
ha: Lasisi: <licenseLink>{ $license }

source: Ligurian
ha: Yaren Liguriya

source: Link Copied
ha: An kopi link

source: Listen
ha: Saurara

source: Listening
ha: Sauraro

source: Listen-Queue
ha: Layin sauraro

source: Lithuanian
ha: Yaren Lithuania

source: Loading…
ha: Yana buɗewa...

source: Localization
ha: Fassarawa

source: Localized
ha: Sarrafawa

source: Login Identity
ha: Bayanan sirrin ka

source: Log in or sign up to get started
ha: Shiga ciki ko yi rijista don farawa

source: Log In / Sign Up
ha: Shiga / Yi rajista

source: Log In / Sign Up with { $company } email
ha: Shiga ciki/Yi rajista da { $company } imel

source: Log Out
ha: Fita Daga ciki

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
ha: Da alamar ba'a saka sautikan da za'a saurara a wannan yaren ba. Taimaka mana wajen naɗar naka sautin yanzu.

source: Luganda
ha: Yaren Luganda

source: Macedonian
ha: Yaren Macedonia

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
ha: Tabbar da bayanan da ka zura suna cike da gamsassun bayanai da za ka iya bayawar ta hanyar sanya baynai inda aka samo. Ba za mu sanya bayanan inda aka samo ba a fili

source: Malagasy
ha: Yaren Malagasy

source: Malayalam
ha: Yaren Malayalam

source: Male
ha: Namiji

source: Maltese
ha: Yaren Maltese

source: Manage Email Subscriptions
ha: Sarrafa Abubuwan da ka sa Imel ɗinka ya dinga ƙarɓa

source: Manage Subscriptions
ha: Sarrafa Abubabuwan da ka sa kanka

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
ha: Wataƙila shafin mu na 'homepageLink> </homepageLink> zai taimaka? Don yin tambaya, don Allah a shiga cikin <matrixLink> Matrix na tattaunawa ta gari </matrixLink>, saka idanu kan lamuran yanar gizo ta <githubLink> GitHub </githubLink> ko ziyarci <discourseLink> dandalin mu na Magana </discourseLink>.

source: Meadow Mari
ha: Yaren Meadow Mari

source: Message
ha: Saƙo

source: Mixed
ha: An cakuda

source: Moksha
ha: Yaren Moksha

source: Mongolian
ha: Yaren Mongolia

source: More
ha: Ƙari

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
ha: Mafi yawan bayanai da manyan kamfanoni suke amfani da su basu samuwa ga mafi yawan mutane. Hakan kuwa naƙasu ne ga ƙirƙira. Hakan ya sa muka fara aikin Common Voice. Aikin zai taimaka wajen sauƙaƙa fasahar gane murya ga kowa da kowa.

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
ha: Mafi yawan bayanai da manyan kamfanoni suke amfani da su mutane ba sa samunsu. Hakan ya sa muka ƙirƙiro wata sabuwar hanyar muka yi manhajar Common Voice. Mun yi manhajar ne don ta taimaka wajen ba wa kowa damar aiki da fasahar gane murya.

source: Most speech databases are trained with an overrepresentation of certain demographics which results in a bias towards <articleLink>male and middle class</articleLink>. Accents and dialects that tend to be under-represented in training data sets are typically associated with groups of people who are already marginalised. Many machines also struggle to understand female voices. This is why in our voice database we want variety!
ha: Yawancin ɗakunan bayanan magana ana horar dasu tare da gabatar da ƙididdigar wasu alƙaluma wanda hakan ke haifar da son zuciya ga <articleLink> maza da masu matsakaitan matsayi </articleLink>. Takaddun lafazi da yarukan da basu da wakilci sosai a cikin bayanan bayanan horo galibi suna da alaƙa da rukunin mutane waɗanda aka riga aka ware su. Hakanan injina da yawa suna gwagwarmaya don fahimtar muryoyin mata.¶ Wannan shine dalilin da ya sa a cikin bayanan muryarmu muke son iri-iri!

source: Mozilla doesn’t pick or favor any one language over another. Instead, Common Voice is a purely community-driven initiative, but it takes <multilangLink>several steps to add a new language</multilangLink> and begin collecting voice donations. First, the Common Voice website needs to be translated so community members can access the contributor experience in their own language. Next, we need a large collection of copyright-free sentences for people to read outloud. Once both of those requirements are satisfied a language is “launched” on Common Voice for people to start recording their voice and validating others donations. If you want to help launch a new language, head over to our <sentenceCollectorLink>sentence collection tool</sentenceCollectorLink> to get started.
ha: Mozilla ba ta ɗauka ko fifita kowane yare akan wani. Madadin haka, Common Voice shiri ne kawai na al'umma, amma yana ɗaukar <multilangLink> matakai da yawa don ƙara sabon yare </multilangLink> kuma fara tattara gudummawar murya. Da farko, ana buƙatar fassara gidan yanar gizo na Voice Voice gama membobin al'umma zasu iya samun damar kwarewar mai bayarwa a cikin yarensu. Abu na gaba, muna buƙatar tarin jimloli mara izini don mutane su karanta a fili. Da zarar waɗannan abubuwan biyu sun gamsu an fara “harshe” a kan Muryar gama gari don mutane su fara yin rikodin muryar su da kuma inganta wasu gudummawar. Idan kanaso ka taimaka ka ƙaddamar da sabon yare, ka koma zuwa ga <sentenceCollectorLink> kayan aikin tattara jumla </sentenceCollectorLink> don farawa.

source: Mozilla is dedicated to keeping the web open and accessible for everyone. To do that we need to empower web creators through projects like Common Voice. As voice technologies proliferate beyond niche applications, we believe they must serve all users equally. That means investing in more languages and accommodating diverse accents and demographics when building and testing voice technologies. Common Voice is a public resource available to everyone and Mozilla teams and developers around the world are already using it on our own projects as well.
ha: Mozilla ta jajurce don tabbatar da yanar gizo buɗaɗɗiya kuma sassauƙa ga kowa da kowa. Don haka muna buƙatar ƙarfafar masu ƙirƙirar fasahar yanar gizo ta hanyar ayyuka irin Common Voice. Yayin da fasahar murya ta bunƙasa, akwai tabbacin zai hidimtawa masu amfani dashi. Wannan na nufin ƙarfafar harsuna da yawa da kuma shigar da karin harsuna mabambanta da juna yarin gini da kuma jarraba fasahohin murya. Common Voice abune na jama'a, ma'aikatan Mozilla da sauran masu fasahar na'ura mai ƙwaƙwalwa suna amfani dashi a ayyuka dabam dabam a faɗin duniya.

source: Mycroft is the world’s first open source assistant. Mycroft runs anywhere - on a desktop computer, inside an automobile, or on a Raspberry Pi.
ha: Mycroft shine mataimaki na farko na buɗe tushen talla a duniya.¶ Mycroft yana gudana ko'ina - a kan kwamfutar tebur, a cikin mota, ko a kan Rasberi Pi.

source: N/A
ha: Babu Wata Bayani

source: Name
ha: Suna

source: Native Language
ha: Harshen uwa

source: Nepali
ha: Yaren Nepali

source: Next
ha: Na gaba

source: Next Goals: { $goal }
ha: Burin gaba: { $goal }

source: No
ha: A'a

source: No gravatar found for your email
ha: Ba'a samu hoton gravatar na imel ɗinka ba

source: No microphone found.
ha: Ba'a samu makirfo ba

source: Norwegian Bokmål
ha: Yaren Norway Bokmål

source: Norwegian Nynorsk
ha: Yaren Norwegian Nynorsk

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
ha: Rubutu: Idan aka saita zuwa 'Gani', wannan saitin za a iya canza shi daga <abubuwan haɗin hoto> Shafin shafi </profileLink>

source: Note: You will still need to select between Speak or Listen to change contribution type.
ha: Bayanin kula: Zaka so ka yi zaɓi tsakanin Magana ko Saurara domin chanza irin gudumawa.

source: Not found
ha: Ba a samo shi ba

source: No Thanks
ha: A'a Nagode

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. If the voice recording you hear matches the words written onscreen.
ha: Yanzu da kun san ɗan ƙarin bayani game da Common Voice, me zai hana ku gwada shi? Latsa gunkin makirufo don fara karanta jimloli a bayyane. <br/> <br/> Idan ka fi so a duba gudummawar muryar wasu mutane, danna gunkin kunnawa. Idan rikodin muryar da kuka ji ya dace da kalmomin da aka rubuta akan fuska.

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
ha: Yanzun da ka sani ɗan ƙarin bayani game da Common Voice, me yasa bazaka jarraba shi ba? Latsa akan alaman ɗaukan murya domin fara karanta jimloli . <br/><br/>idan ka gwammaci duba gudumawar muryar wasu mutane, danna kan alamar farawa. Zaka taimaka tabbatar cewa ɗaukar muryar ta dace da jimloli da aka rubuta akan allo.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
ha: Yanzu zaka iya bayar da gudummawar muryarka domin gina database ɗin muryoyin jama'a na kyauta wanda kuma kowa ka iya yin amfani dashi domin ƙirƙirar manhajojin nau'ra mai ƙwaƙwalwa da kuma yanar gizo. Karanta jimla domin ka taimakawa na'ura mai ƙwaƙwalwa wajen fahimttar yadda mutane na gaske suke magana. Ka binciki ayyukan sauran masu bada gudummawa domin haɓaka ingancinsu. Abu mai sauƙi!

source: Number of Voices
ha: Adadin muryoyi

source: Occitan
ha: Yaren Occitan

source: Odia
ha: Yaran Odiya

source: Off
ha: Kashe

source: Offensive language
ha: Yare mai ɓatanci

source: Offensive speech
ha: Kalaman ɓatanci

source: On
ha: Kunna

source: On desktop devices you can contribute by downloading…
ha: A kan kwamfuta mai kwakwalwa za ka iya sauƙe sabon abu...

source: On iOS please continue with Safari to enable recording…
ha: Akan iOS don Allah ci gaba da Safari don yin rikodin…

source: Optionally join on our email list for updates and new information about the project.
ha: Da zaɓinka shiga cikin tsarin jarinmu na imel don sabin bayanai game da aikin.

source: Optionally submitted demographic data (e.g. age, gender, language, and accent) will never be made public on your profile, and will not be linked to your account in the dataset. Individual audio clips will be associated with demographic data for the purpose of more accurate analysis - for example, a researcher might want to target a training model to a specific demographic segment.
ha: A zaɓinka bada alƙaluma na bayanai (misali. shekara, jinsi, yare, da kabila) baza'a taɓa bayyana shi wa jama'a ba a profayil ɗinka, kuma baza'a taɓa haɗa shi da wurin karin bayani akanka ba. Ko wani murya ta kowa-da-kowa za'a danganta shi da labaran alƙaluma domin dalilan samun tsareren bincike - misali, mai bincike yayu ya nufi wata hanyar horaswa domin alƙaluma ta musamman.

source: or Delete voice clip
ha: ko Goge shashin muryar

source: Other
ha: Saura

source: Other Language
ha: Sauran Yare

source: Other voice datasets…
ha: Sauran bayanai (datasets) na muryoyi

source: Other Voice Datasets
ha: Sauran Bayanai(Dataset) na Muryoyi

source: Our source text is made up of original contributor donations as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life</italic>. You can view our source sentences in this <githubLink>GitHub folder</githubLink>.
ha: Rubutun asalinmu ya kasance ne da gudummawar masu ba da gudummawa ta asali da kuma tattaunawa daga rubuce-rubucen fim na yanki kamar jama'a Kuna iya duba jumlar tushen mu a cikin wannan <githubLink> GitHub babban fayil </githubLink>.

source: Overall Accuracy
ha: Gaba ɗayar daidaito

source: Overall Hr. Total
ha: Jumullar Awowin da aka ƙirga

source: Overall project status: see how far we’ve come!
ha: Matsayar aikinnan: duba abinda muka cimma!

source: Partners
ha: Abokan hulɗa

source: Persian
ha: Yaren Fasha

source: Personal dashboards keep you up-to-date with individual and community progress.
ha: Keɓaɓɓun maɓallan allo suna ba ku damar kasancewa tare da ci gaban mutum da al'umma.

source: <playIcon></playIcon>Last one!
ha: <playIcon> </ playIcon> Na karshe!

source: Play/Stop
ha: Fara/Tsaya

source: Polish
ha: Yaran Folish

source: Portuguese
ha: Yaren Portugal

source: Portuguese (Brazil)
ha: Yaren Portuguese (Mazauna Brazil)

source: Press play, listen & tell us: did they accurately speak the sentence below?
ha: Danna fara, sai ka saurara sannan ka bayyana mana: Yadda suka faɗi wannan jimla ta ƙasa dai dai ne?

source: Press { shortcut-play-toggle } to toggle play mode
ha: Danna { shortcut-play-toggle } don Cigaba ko ka tsayar da sauraro

source: Privacy
ha: Sirri

source: Privacy Policy
ha: Sirri tsari

source: Pro
ha: Gwani

source: Profile
ha: Bayananka

source: Profile information improves the audio data used in training speech recognition accuracy.
ha: Bayanan da ka sa a Profile dinla suna taimakawa wajen horasta kimiyyar gane murya.

source: Progress
ha: Cigaba

source: Punjabi
ha: Yaren Punjabi

source: Read More
ha: Ci gaba da Karantawa

source: Read more on our About page
ha: Kara karantawa game da Mu a shafinmu

source: Ready to add your voice or lend your ear?
ha: Shirya don ƙara muryarka ko rancen kunnenka?

source: Ready to contribute?
ha: Shirya don ba da gudummawa?

source: Ready to do { $count } more?
ha: Shiryawa don yi { $count } ƙari?

source: Ready to donate your voice?
ha: Ka shirya don ba da muryaka?

source: Ready to help validate sentences?
ha: Shirya don taimakawa inganta jumla?

source: Receive emails such as challenge and goal reminders, progress updates, and newsletters about Common Voice.
ha: Karɓi imel kamar kalubale da masu tuni, burin sanarwa game da abin da an cimma, da wasiƙun labarai game da Muryar gama gari.

source: Recorded Clips
ha: Sautikan da aka naɗa

source: Recorded Hours
ha: Sa'o'in da aka naɗa

source: <recordIcon></recordIcon> Last one!
ha: <recordIcon> </ recordIcon> Na karshe!

source: Recording
ha: Rekodi

source: Recordings
ha: Rekodin

source: Recording voice clips is an integral part of building our open dataset; some would say it's the fun part too.
ha: naɗar sautikan murya yana cikin ayyukan gina dataset na kyauta; wasu ma cewa suke shine abu mafi daɗi a cikin aikin.

source: Record/Stop
ha: Yi Rekodin/ Tsaya

source: RECORD VOICEWAVE
ha: ƊAUKAR KALAMAN MURYA

source: Record your voice
ha: Naɗi muryarka

source: Recreate Voicewave
ha: Sake kirkira Muryar Murya

source: Remove
ha: Cire

source: Report
ha: Rahoto

source: Report was passed successfully
ha: Rahoton ya wuce cikin nasara

source: Request a Language
ha: Nemi izinin wani yaren

source: *required
ha: * Ana buƙata

source: Re-record
ha: Sake rikodi

source: RE-RECORD
ha: SAKE-NAƊA

source: Re-record clip
ha: Kara daukan shirin

source: RETRY
ha: SAKE GWADAWA

source: Return here to edit your goal anytime.
ha: Koma nan don gyara burin ka kowane lokaci.

source: Return to Common Voice
ha: Koma zuwa ga Muryar Gama-Gari

source: Return to Common Voice Datasets
ha: Komo zuwa ga tsarin bayani na Common Voice

source: Return to Languages
ha: Komo zuwa ga Harsuna

source: Review
ha: Nazari

source: Review & re-record clips here as you go
ha: Duba & sake yin rikodin shirye-shiryen bidiyo a nan yayin da kuka tafi

source: Review & re-record clips if needed
ha: Duba & sake yin rikodin shirye-shiryen bidiyo idan an buƙata

source: Review & Submit
ha: Sake Nazari ka Tura

source: Romanian
ha: Romaniyanci

source: Romansh Sursilvan
ha: Yaren Romawa Sursilbaniya

source: Romansh Vallader
ha: Yaren Romansh Vallader

source: Russian
ha: Rashanci

source: Sakha
ha: Yaren Sakha

source: Sardinian
ha: Yaran Sardiniya

source: Save
ha: Ajiye

source: Saved
ha: An Ajiye

source: Search
ha: Nemo

source: Search for answers
ha: Binciko amsoshi

source: See how your progress compares to other contributors all over the world.
ha: Gwada yawan gudummawarka da ta sauran masu bada gudummawa a duk faɗin duniya.

source: See Less
ha: Duba Kadan

source: See More
ha: Duba Ƙari

source: Select a Language...
ha: Zaɓi yare...

source: Send sign up link
ha: Aika hanyar haɗin rajista

source: Sentence Collection
ha: Haɗe-haɗen jimloli?

source: Sentences
ha: Jumloli

source: Serbian
ha: Yaren Serbiya

source: Set a goal
ha: Saita manufa

source: Set my visibility
ha: Sanya gani na

source: Settings
ha: Saituna

source: Sex
ha: Jinsi

source: Share Common Voice
ha: Raba Common Voice

source: Share my goal
ha: Raba burina

source: Share your clip
ha: Raba shirin ka na ɓangaren bidiyo

source: Share your { $count } Clip Daily Goal for { $type }
ha: Raba { $count } shashin bidiyo naka na yau da Kullum domin { $type }

source: Share your { $count } Clip Weekly Goal for { $type }
ha: Raba { $count } burnika na shashin bidiyo na mako-mako { $type }

source: Shortcuts
ha: Gajerun hanyoyi

source: Show my ranking
ha: Nuna mini daraja ta

source: Sicilian
ha: Yaren Sicilian

source: Sign up for an account
ha: Yi rajista.

source: Sign up for Common Voice newsletters, goal reminders and progress updates
ha: Yi rejista dumin samun wasikun Common Voice, tunatarwa na buri da labarun sabuntawa

source: sign up for email updates
ha: Yi rajista domin samin saƙonnin email.

source: Sign up for { $lang } updates:
ha: Shigo don samun abubuwan da ke gudana a yaren { $lang }

source: Sinhala
ha: Yaren Sinhala

source: Size
ha: Girma

source: Skip
ha: Wuce

source: Skip Submission Feedback
ha: Tsallake bayar da bayani

source: Slovak
ha: Yaran Slobak

source: Slovenian
ha: Yaren Slobaniya

source: Sorbian, Lower
ha: Yaren Sobiyan, Na ƙasa

source: Sorbian, Upper
ha: Yaren Sobiya, Na sama

source: Spanish
ha: Sifaniyanci

source: Speak
ha: Yi magana

source: Speakers
ha: Masu Magana

source: Speaking
ha: Yin magana

source: Speaking and Listening
ha: Yin magana da Sauraro

source: Speak now
ha: Yi magana yanzu

source: Speak up, contribute here!
ha: Yi Magana, don ka taimaka!

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
ha: <speechBlogLink> Farawa tare da Gano Magana </speechBlogLink>

source: Speech is often the most natural way we communicate with each other and voice technologies are bringing that convenience to our computers and mobile devices. We want to empower developers to build amazing voice recognition applications like real-time translators and voice-enabled digital assistants. But right now most of the voice data required to build these kinds of apps is expensive and proprietary. We hope the Common Voice dataset will give developers what they need to innovate and make speech technology available in their own language. To make voice recognition even more universal, we're collecting voice samples in widely spoken languages as well as those with a smaller population of speakers often underserved by commercial speech recognition services. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and entire speech communities to address this gap themselves.
ha: Magana shine mafi akalar hanyar da muke sadarwa tare da juna kuma fasahar murya suna kawo wannan dacewar ga kwamfutocinmu da na'uran hannu. Muna so mu ƙarfafa masu haɓakawa don gina aikace-aikacen gane murya mai ban mamaki kamar masu fassara na ainihi da mataimakan masu amfani da dijital. Amma a yanzu yawancin bayanan muryar da ake buƙata don gina waɗannan nau'ikan aikace-aikacen suna da tsada da mallakar ta. Muna fatan kundin bayanan gama gari zai ba masu haɓaka abin da suke buƙata don ƙirƙirawa da kuma samar da fasahar magana a cikin yarensu.¶ ¶ Don ƙara fahimtar murya har ma ta game duniya, muna tattara samfuran murya a cikin yarukan da ake magana da su da kuma waɗanda ke da ƙaramin yawan masu magana waɗanda yawancin lokuta ba sa samun kula daga sabis na fahimtar magana. Buga ɗakunan bayanai daban-daban na muryoyi zai ƙarfafa masu haɓakawa, 'yan kasuwa, da dukkanin al'ummomin magana don magance wannan ratar da kansu.

source: Speech-to-text (STT)
ha: Mangana-Zuwa-Rubutu(STT)

source: Speech-to-text (STT) technologies convert voice data into text.
ha: Fasahar magana-zuwa-rubutu (STT) suna sauya bayanan murya zuwa rubutu.

source: Splits
ha: Rarraba

source: Start recording
ha: Fara Ɗaukar Murya

source: Stats
ha: Fara
